# Pandas
---

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license.

---

In [ ]:
pip install jovian --upgrade

In [1]:
import jovian

In [2]:
import numpy as np
import pandas as pd

In [3]:
lables = ['a','b','c']

In [4]:
mydata = [10,20,30]

In [5]:
a = np.array(mydata)
a

array([10, 20, 30])

In [6]:
# dict
d = {'a': 10,'b': 20,'c': 30}

### Panda - Series

It is basically numpy array but instead of index it has got lables see the arguments below :<br>
```
pd.Series(data = mydata, index = mylables)
```

In [7]:
# auto indexed conversion of np.array container(a) to pd.Series

pd.Series(a)

0    10
1    20
2    30
dtype: int64

In [8]:
# This time instead of auto index we use manual index defined in lables

pd.Series(data = a, index = lables)

a    10
b    20
c    30
dtype: int64

In [9]:
# Make a pd series object

ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

---
### Adding  multiple pd Series by their index :

In [10]:
# we already have ser1, lets create ser2

ser2 = pd.Series([1,5,11,4],index = ['USA','Germany','Italy','Japan'])
ser2

USA         1
Germany     5
Italy      11
Japan       4
dtype: int64

In [11]:
# Return ser1 + ser2
# Note if there are certain indices only in one of the ser and not in other then result of add would be NaN

ser1 + ser2

Germany    7.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

---
### Creating DataFrames using a 2D container of numpy
DataFrames are basically named index(rows) and named cols
```
pd.DataFrame(data = {container name},index = {lable of rows}, columns = {lable of cols})
```

In [12]:
# We use random seed to generate a random set of numbers which does not change if the notebook is re-run

from numpy.random import randn
np.random.seed(101)
rand_mat = randn(5,4)
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [13]:
df = pd.DataFrame(data = rand_mat,index = "A B C D E".split(), columns= "W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

####  Access or grab the cols :

In [14]:
# grab cols

df[['Y','W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118
C  0.528813 -2.018168
D -0.933237  0.188695
E  2.605967  0.190794

#### Creating new col :

In [15]:
# Creating new col using prev cols

df['New'] = df['W'] + df['Y']
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

#### Drop or del cols : 
**Note 1** -> specify axis while using this function (axis = 0 {default}) for rows and 1 for col. <br>
**Note 2** -> Inplace property by default is false thus drop wont change the original data frame, but if u make it true then this drop will affect the original one.<br><br>
**Format** :
```
df.drop({name of col}, {axis}, {inplace})
```

In [16]:
df.drop('New', axis = 1,inplace = True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Access the index or the rows
**Format :**
```
df.loc[{list}]
```

In [17]:
# access the elements of row A and D

df.loc[['A','D']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [18]:
# access the elements of row A but this time by index
"""
A -> 0
B -> 1
.
.
.
"""
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Accessing slice of a matrix :

In [19]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

#### Convert the table to bool using a specific condition :

In [20]:
# Convert the table into true false using a condition check

df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [21]:
# Returns those numbers which satisfy the condition

df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
# try to Reject the row where W has negetive or zero value

df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**Note : For panda Series 'and' , 'or' of native python is not supported, Instead use  & , |**

In [23]:
cond1 = df['W'] > 0
cond2 = df['Y'] > 1
df[ (cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### Set and Reset Index :

In [24]:
# For example u want to reset the index A-Z to default 0-4 

df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [25]:
new_ind = "One Two Three Four Five".split()

In [26]:
new_ind

['One', 'Two', 'Three', 'Four', 'Five']

In [27]:
df['Nums'] = new_ind

In [28]:
df

          W         X         Y         Z   Nums
A  2.706850  0.628133  0.907969  0.503826    One
B  0.651118 -0.319318 -0.848077  0.605965    Two
C -2.018168  0.740122  0.528813 -0.589001  Three
D  0.188695 -0.758872 -0.933237  0.955057   Four
E  0.190794  1.978757  2.605967  0.683509   Five

In [29]:
# Now suppose u wanna use nums as the index of this table

df.set_index('Nums')

              W         X         Y         Z
Nums
One    2.706850  0.628133  0.907969  0.503826
Two    0.651118 -0.319318 -0.848077  0.605965
Three -2.018168  0.740122  0.528813 -0.589001
Four   0.188695 -0.758872 -0.933237  0.955057
Five   0.190794  1.978757  2.605967  0.683509

### Information about the data frame :

In [30]:
# df.info() provides a lot of ifo abt the table

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
W       5 non-null float64
X       5 non-null float64
Y       5 non-null float64
Z       5 non-null float64
Nums    5 non-null object
dtypes: float64(4), object(1)
memory usage: 400.0+ bytes

In [31]:
# df.dtypes provides info abt data types

df.dtypes

W       float64
X       float64
Y       float64
Z       float64
Nums     object
dtype: object

In [32]:
# df.describe() provides a lot of useful information abt the table

df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

---
### Group by :

In [33]:
# sample data

data = { 'Company' : ['Goog', 'Goog', 'Msft', 'Msft', 'FB', 'FB' ],
          'Person' : ['Sam', 'Tim','Charles', 'Monn', 'Joe', 'Anna'],
          'Sales'  : [200, 120, 340, 124, 243, 350]}

In [34]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog      Tim    120
2    Msft  Charles    340
3    Msft     Monn    124
4      FB      Joe    243
5      FB     Anna    350

In [35]:
# operating grp by

df.groupby('Company').describe().transpose()

Company              FB        Goog        Msft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

---
### Operations :

In [36]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Info on Unique Values :

In [37]:
# Displays unique values, len(container) to get count of unique values

df['col2'].unique()

array([444, 555, 666])

In [38]:
# Count number of times each unique value has been repeated

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Selecting data :

In [39]:
# Select from DataFrame using criteria from multiple columns

newdf = df[(df['col1']>2) & (df['col2']==444)]

In [40]:
newdf

   col1  col2 col3
3     4   444  xyz

#### Application of function :

In [43]:
def times2(x):
    return x*2

In [44]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [47]:
df['New'] = df['col1'].apply(times2)
df

   col1  col2 col3  New
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [48]:
del df['New']
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [50]:
# columns name

df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [51]:
# index name 

df.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
# description -> .info()

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [57]:
# description -> ..describe()

df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

### Sorting :

In [61]:
df.sort_values('col2', ascending = False) #inplace=False by default

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

---
### Read from Files or Websites (Tables) :

### CSV Input
Comma Separated Values files are text files that use commas as field delimeters.<br>
Unless you're running the virtual environment included with the course, you may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br>
In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [65]:
# replace example.csv with your csv
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [66]:
df.to_csv('example.csv',index=False)

###  Excel :
Pandas can read and write MS Excel files. However, this only imports data, not formulas or images. A file that contains images or macros may cause the <tt>.read_excel()</tt>method to crash.

### Excel input :

In [68]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [69]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

### HTML
Pandas can read table tabs off of HTML.<br>
Unless you're running the virtual environment, you may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install beautifulsoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [106]:
mytable = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [107]:
type(mytable)

list

In [108]:
len(mytable)

1

In [109]:
df = mytable[0]

In [110]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [111]:
jovian.commit()

[jovian] Attempting to save notebook..
[jovian] Uploading notebook..
[jovian] Capturing environment..
[jovian] Committed successfully! https://jovian.ml/sayantan-world98/pandas

'https://jovian.ml/sayantan-world98/pandas'